-- INSERT INTO HardwareClasses (name) VALUES
-- ('Программно-аппаратные комплексы, обеспечивающие выполнение установленных действий при проведении оперативно-розыскных мероприятий'),
-- ('Программно-аппаратный комплекс в сфере здравоохранения'),
-- ('Программно-аппаратный комплекс в сфере торговли'),
-- ('Программно-аппаратный комплекс в сфере транспорта'),
-- ('Программно-аппаратный комплекс в сфере цифровой печати'),
-- ('Программно-аппаратный комплекс виртуализации'),
-- ('Программно-аппаратный комплекс виртуальной реальности'),
-- ('Программно-аппаратный комплекс для Java приложений'),
-- ('Программно-аппаратный комплекс для «Умного многоквартирного дома»'),
-- ('Программно-аппаратный комплекс для искусственного интеллекта'),
-- ('Программно-аппаратный комплекс для отраслей промышленности'),
-- ('Программно-аппаратный комплекс мониторинга и защиты от беспилотных летательных объектов'),
-- ('Программно-аппаратный комплекс мониторинга и управления'),
-- ('Программно-аппаратный комплекс обработки больших массивов данных'),
-- ('Программно-аппаратный комплекс передачи информации'),
-- ('Программно-аппаратный комплекс предназначенный для практического обучения'),
-- ('Программно-аппаратный комплекс сбора, доступа (запись и извлечение), хранения, извлечения, анализа и обработки данных'),
-- ('Программно-аппаратный комплекс, выполняющий контрольно-измерительные функции (средства измерения)'),
-- ('Программно-аппаратный комплекс, предназначенный для обеспечения информационной безопасности');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (1, 'Программно-аппаратные комплексы для проведения оперативно-розыскных мероприятий'),
-- (1, 'Программно-аппаратные комплексы систем накопления и хранения данных для проведения оперативно-розыскных мероприятий');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (2, 'Программно-аппаратные комплексы в сфере строительства и жилищно-коммунального хозяйства'),
-- (2, 'Программно-аппаратные комплексы для проведения диагностики и лечения'),
-- (2, 'Программно-аппаратные комплексы для управления городским хозяйством');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (3, 'Программно-аппаратные комплексы для автоматизации рабочего места кассира'),
-- (3, 'Программно-аппаратные комплексы для обеспечения товарного учёта'),
-- (3, 'Программно-аппаратные комплексы для осуществления приёма платежей'),
-- (3, 'Программно-аппаратные комплексы для осуществления расчётов индивидуальными предпринимателями или юридическими лицами с покупателями'),
-- (3, 'Программно-аппаратные комплексы для осуществления этикетирования при взвешивании'),
-- (3, 'Программно-аппаратные комплексы для штрихкодирования товаров, услуг или работ'),
-- (3, 'Программно-аппаратные комплексы информационного киоска');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (4, 'Программно-аппаратный комплекс / система фото/видео фиксации нарушений правил дорожного движения'),
-- (4, 'Программно-аппаратные комплексы абонентские телематические терминалы'),
-- (4, 'Программно-аппаратные комплексы вызова экстренных оперативных служб'),
-- (4, 'Программно-аппаратные комплексы дорожного контроллера'),
-- (4, 'Программно-аппаратные комплексы дорожной инфраструктуры V2X (англ. - Road Side Unit, RSU)'),
-- (4, 'Программно-аппаратные комплексы платформы V2X (ядро сети V2X)'),
-- (4, 'Программно-аппаратные комплексы управления дорожным движением');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (5, 'Программно-аппаратные комплексы переноса изображений и печати'),
-- (5, 'Программно-аппаратные комплексы распределенных систем цифровой печати');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (6, 'Вычислительные программно-аппаратные комплексы виртуализации и управления ресурсами в среде облачных вычислений'),
-- (6, 'Вычислительные программно-аппаратные комплексы виртуализации рабочих мест и рабочих мест с доступом к виртуальным рабочим местам'),
-- (6, 'Вычислительные программно-аппаратные комплексы контейнерной виртуализации и пайплайна разработки');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (7, '3DOF программно-аппаратные комплексы виртуальной реальности'),
-- (7, '6DOF программно-аппаратные комплексы виртуальной реальности'),
-- (7, 'Автономные программно-аппаратные комплексы виртуальной реальности');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (8, 'Программно-аппаратные комплексы для автоматизации рабочего места кассира (Point of sale system, KCO, ТСО) с установленными JAVA-приложениями'),
-- (8, 'Программно-аппаратные комплексы для обеспечения товарного учёта с установленными JAVA-приложениями'),
-- (8, 'Программно-аппаратные комплексы для осуществления приёма платежей с установленными JAVA-приложениями'),
-- (8, 'Программно-аппаратные комплексы для осуществления расчётов индивидуальными предпринимателями или юридическими лицами с покупателями с установленными JAVA-приложениями');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (9, 'Программно-аппаратные комплексы автоматизированных систем управления зданиями для «Умного многоквартирного дома»'),
-- (10, 'Программно-аппаратные комплексы для искусственного интеллекта');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (11, 'Программно-аппаратные комплексы автоматизированного управления технологическим процессом'),
-- (11, 'Программно-аппаратные комплексы диспетчерского управления производством'),
-- (11, 'Программно-аппаратные комплексы контроля и диагностики оборудования'),
-- (11, 'Программно-аппаратные комплексы контроля технического состояния оборудования'),
-- (11, 'Программно-аппаратные комплексы планирования производством и поставкой'),
-- (11, 'Программно-аппаратные комплексы реального времени'),
-- (11, 'Программно-аппаратные комплексы регулирования режимов работы технологического оборудования'),
-- (11, 'Программно-аппаратные комплексы технического обслуживания активов'),
-- (11, 'Программно-аппаратные комплексы управления запасами'),
-- (11, 'Программно-аппаратные комплексы управления производством');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (12, 'Модульные программно-аппаратные комплексы мониторинга и защиты от беспилотных летательных объектов');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (13, 'Вычислительные программно-аппаратные комплексы управления многомодельными базами данных'),
-- (13, 'Вычислительные программно-аппаратные комплексы управления базами данных «ключ-значение»'),
-- (13, 'Вычислительные программно-аппаратные комплексы управления базами данных временных рядов'),
-- (13, 'Вычислительные программно-аппаратные комплексы управления базами данных колоночного хранения'),
-- (13, 'Вычислительные программно-аппаратные комплексы управления базами данных комбинированного типа'),
-- (13, 'Вычислительные программно-аппаратные комплексы управления базами данных реляционного типа'),
-- (13, 'Вычислительные программно-аппаратные комплексы управления графовыми базами данных'),
-- (13, 'Вычислительные программно-аппаратные комплексы управления документоориентированными базами данных'),
-- (13, 'Программно-аппаратные комплексы интеллектуального управления'),
-- (13, 'Программно-аппаратные комплексы мониторинга и управления'),
-- (13, 'Программно-аппаратные комплексы сбора, анализа и визуализации информации различных сред и процессов'),
-- (13, 'Программно-аппаратные комплексы управления визуализацией информации'),
-- (13, 'Программно-аппаратные комплексы управления информационными ресурсами и управления основными данными'),
-- (13, 'Программно-аппаратные комплексы, предоставляющие для решения задач, возникающих на различных этапах управления данными, в том числе преобразования, поиска и анализа информации с применением искусственного интеллекта');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (14, 'Вычислительные программно-аппаратные комплексы для распределенной обработки данных'),
-- (14, 'Вычислительные программно-аппаратные комплексы для резидентной обработки данных в оперативной памяти');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (15, 'Модульные программно-аппаратные комплексы базовых станций'),
-- (15, 'Модульные программно-аппаратные комплексы маршрутизации и коммутации');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (16, 'Программно-аппаратные комплексы организации обучения и контроля навыков');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (17, 'Геоинформационные и навигационные (GIS) программно-аппаратные комплексы'),
-- (17, 'Модульные программно-аппаратные комплексы на основе гибкой архитектуры, оптимизированные под различные нагрузки и различный программный стек с возможностью эластичного использования ресурсов'),
-- (17, 'Программно-аппаратные комплексы аналитической обработки в реальном времени'),
-- (17, 'Программно-аппаратные комплексы извлечения и трансформации данных (ETL)'),
-- (17, 'Программно-аппаратные комплексы интеллектуального анализа данных (Data Mining)'),
-- (17, 'Программно-аппаратные комплексы математического и имитационного моделирования'),
-- (17, 'Программно-аппаратные комплексы обеспечения облачных и распределенных вычислений'),
-- (17, 'Программно-аппаратные комплексы обработки больших данных (BigData)'),
-- (17, 'Программно-аппаратные комплексы обработки и анализа геологических и геофизических данных'),
-- (17, 'Программно-аппаратные комплексы обработки, анализа и распознавания изображений'),
-- (17, 'Программно-аппаратные комплексы объектного хранилища'),
-- (17, 'Программно-аппаратные комплексы распределенного дискового массива'),
-- (17, 'Программно-аппаратные комплексы систем речевой аналитики и речевого оповещения'),
-- (17, 'Программно-аппаратные комплексы системы хранения данных'),
-- (17, 'Программно-аппаратные комплексы, созданные на машинах вычислительных электронных цифровых (клиентские системы)'),
-- (17, 'Программно-аппаратные комплексы, созданные на серверах или устройствах, содержащие в своем составе один или более вычислительных узлов');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (18, 'Программно-аппаратные комплексы экологического мониторинга внешней среды'),
-- (18, 'Программно-аппаратные комплексы атмосферного мониторинга'),
-- (18, 'Программно-аппаратные комплексы высокотехнологичных отраслей'),
-- (18, 'Программно-аппаратные комплексы гидромониторинга окружающей среды'),
-- (18, 'Программно-аппаратные комплексы для автоматизированного и роботизированного контроля в промышленном производстве'),
-- (18, 'Программно-аппаратные комплексы для мониторинга технического состояния энергетического оборудования'),
-- (18, 'Программно-аппаратные комплексы для мониторинга утечек'),
-- (18, 'Программно-аппаратные комплексы измерения параметров технологических процессов в промышленном производстве'),
-- (18, 'Программно-аппаратные комплексы измерения, учёта и анализа потребления ресурсов промышленными объектами'),
-- (18, 'Программно-аппаратные комплексы мониторинга геологических процессов'),
-- (18, 'Программно-аппаратные комплексы мониторинга геотехнических сооружений'),
-- (18, 'Программно-аппаратные комплексы мониторинга дорожных ситуаций и оценки дорожного полотна'),
-- (18, 'Программно-аппаратные комплексы радиоизмерительных приборов общего назначения для промышленности и метрологии');

-- INSERT INTO HardwareSubclasses (hardware_class_id, name) VALUES
-- (19, 'Программно-аппаратные комплексы администрирования и управления жизненным циклом ключевых носителей'),
-- (19, 'Программно-аппаратные комплексы антивирусной защиты'),
-- (19, 'Программно-аппаратные комплексы выявления целевых компьютерных атак'),
-- (19, 'Программно-аппаратные комплексы гарантированного уничтожения данных'),
-- (19, 'Программно-аппаратные комплексы для безопасного прямого сбора данных с промышленного контура предприятия с последующей предобработкой, конвертацией и передачей их в информационные системы'),
-- (19, 'Программно-аппаратные комплексы для безопасного хранения и переноса информации'),
-- (19, 'Программно-аппаратные комплексы для защиты программного обеспечения от нелегального копирования и использования'),
-- (19, 'Программно-аппаратные комплексы для обеспечения безопасной дистанционной работы'),
-- (19, 'Программно-аппаратные комплексы для обеспечения безопасной разработки программного обеспечения'),
-- (19, 'Программно-аппаратные комплексы для обнаружения угроз и расследования сетевых инцидентов'),
-- (19, 'Программно-аппаратные комплексы для однонаправленной передачи информации'),
-- (19, 'Программно-аппаратные комплексы для работы в выделенных помещениях и для обработки сведений, содержащих государственную тайну'),
-- (19, 'Программно-аппаратные комплексы защиты информации и электронной подписи'),
-- (19, 'Программно-аппаратные комплексы защиты каналов передачи данных, в том числе криптографическими методами'),
-- (19, 'Программно-аппаратные комплексы защиты от мошенничества'),
-- (19, 'Программно-аппаратные комплексы защиты от несанкционированного доступа к информации'),
-- (19, 'Программно-аппаратные комплексы квантовых криптографических систем выработки и распределения ключа'),
-- (19, 'Программно-аппаратные комплексы ключевых носителей'),
-- (19, 'Программно-аппаратные комплексы межсетевых экранов'),
-- (19, 'Программно-аппаратные комплексы обнаружения и предотвращения утечек информации'),
-- (19, 'Программно-аппаратные комплексы обнаружения и/или предотвращения вторжений (атак)'),
-- (19, 'Программно-аппаратные комплексы организации информационного периметра'),
-- (19, 'Программно-аппаратные комплексы резервного копирования'),
-- (19, 'Программно-аппаратные комплексы средства автоматизации процессов информационной безопасности'),
-- (19, 'Программно-аппаратные комплексы управления доступом к информационным ресурсам'),
-- (19, 'Программно-аппаратные комплексы управления событиями информационной безопасности'),
-- (19, 'Программно-аппаратные комплексы фильтрации негативного контента'),
-- (19, 'Программно-аппаратные комплексы эмуляции устройств');
